**** We cannot get far in any programming language without a means of mapping names to values,
     that is, we need a method for creating variables. To do this in Scheme, we use the `define`
     keyword: 
     #+BEGIN_SRC scheme
       (define pi 3.14)
     #+END_SRC

     #+RESULTS:
     : #<void>

**** When we notate Lisp program text, we use 'symbolic expression' or 's-expressions/sexprs'.
      Lisp programs are valid sexprs, but not all sexprs are valid Lisp programs.
      Diagramming sexprs leads to clear tree structures (nodes + branches) - as is shown in 
      Figure 1.1:

      ;; An expression, or more completely, a Lisp s-expression
      #+BEGIN_SRC scheme
        (* (+ 2 (* 4 6)) (+ 3 5 7))
      #+END_SRC

      #+RESULTS:
      : 390

      ;; Notated s-expression
      ;; 
      ;;               390_______
      ;;              /  |       \__
      ;;             *   26         15
      ;;               / | \     / | \  \
      ;;             +   2  24  +  3  5  7
      ;;                   / | \
      ;;                  *  4  6
